history = [
    
]

conversation_state_memory = {
    "phase": "INIT",
    "best_city": None
}

cities = {
    "rasht":"رشت",
    "shiraz":"شیراز",
    "tehran":"تهران",
    "yazd":"یزد",
    "mashhad":"مشهد",
    "esfahan":"اصفهان",
    
}

cities_p = {
    "رشت":"rasht",
    "شیراز":"shiraz",
    "تهران":"tehran",
    "یزد":"yazd",
    "مشهد":"mashhad",
    "اصفهان":"esfahan",
}
CITY_SIGNATURE = {
    "rasht": "nature",
    "tehran": "recreational",
    "mashhad": "religious",
    "shiraz":"historical",
    "yazd":"historical",
    "esfahan":"historical"
}

intrest_dict = {
    "طبیعت":"nature",
    "خرید":"recreational",
    "تاریخی":"historical",
    "شهری":"recreational",
    "زیارت":"religious"
}

city_list = ["تهران" , "مشهد" ,"یزد","شیراز","اصفهان","رشت"]

import re

def translate(city):
    if re.fullmatch(r"[A-Za-z]+", city):
        city_per =cities[city]
        return city_per , city
    else:
        city_en = cities_p[city]
        return city , city_en
    

offline_weather = {
    "تهران": "متاسفانه فعلا اطلاعات دقیق آب‌وهوای تهران در دسترس نیست، اما تهران معمولا آب‌وهوایی نیمه‌خشک دارد؛ تابستان‌ها گرم و زمستان‌ها نسبتاً سرد است.",

    "شیراز": "متاسفانه فعلا اطلاعات دقیق آب‌وهوای شیراز در دسترس نیست، اما شیراز معمولا آب‌وهوایی معتدل دارد؛ بهار آن بسیار دلپذیر و تابستان‌ها نسبتاً گرم است.",

    "اصفهان": "متاسفانه فعلا اطلاعات دقیق آب‌وهوای اصفهان در دسترس نیست، اما اصفهان معمولا آب‌وهوایی خشک دارد؛ تابستان‌ها گرم و زمستان‌ها خنک تا سرد است.",

    "مشهد": "متاسفانه فعلا اطلاعات دقیق آب‌وهوای مشهد در دسترس نیست، اما مشهد معمولا تابستان‌های گرم و زمستان‌های سرد دارد و اختلاف دمای فصلی در آن قابل توجه است.",

    "یزد": "متاسفانه فعلا اطلاعات دقیق آب‌وهوای یزد در دسترس نیست، اما یزد یکی از خشک‌ترین شهرهای ایران است؛ تابستان‌های بسیار گرم و زمستان‌های نسبتاً سرد دارد.",

    "رشت": "متاسفانه فعلا اطلاعات دقیق آب‌وهوای رشت در دسترس نیست، اما رشت معمولا آب‌وهوایی مرطوب و بارانی دارد و در بیشتر ماه‌های سال احتمال بارش وجود دارد."
}